Revit 2027 API
LineLoad.SetPoints Method
 Sets start and end point of the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetPoints(
	XYZ startPoint,
	XYZ endPoint
)
Public Function SetPoints (
	startPoint As XYZ,
	endPoint As XYZ
) As Boolean
public:
bool SetPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
member SetPoints :
        startPoint : XYZ *
        endPoint : XYZ -> bool
Parameters
startPoint XYZ
 The start point.
endPoint XYZ
 The end point.
Return Value
Boolean
 Returns true if successful, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the end point is equal to the start point.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This LineLoad is not a hosted object. -or- This LineLoad is constrained on host.
Remarks
 This method works with hosted line load only. This method works for loads which are not constrained to their host. The curve of the resulted load will be a line.
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace